
#12. Визначити якому квадранту належть точка з координатами x,y

print("12. Визначити якому квадранту належть точка з координатами x,y")


x = int(input("Введіть значення x ")) # вводимо значення x
y = int(input("Введіть значення y ")) # вводимо значення y
answer = ""
if x==0 or y==0:
    answer = "Точка знаходиться на координатній осі"
else:
    if x>0:
        if y>0:
            answer = "Точка в першому квадранті"
        else:
            answer = "Точка в четвертому квадранті"
    else:
        if y>0 :
            answer = "Точка в другому квадранті"
        else:
            answer = "Точка в третьому квадранті"

print(answer) # виводимо квадрант точки

